///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2022, ООО Профинтех
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс


// Инициализация компоненты сканирования.
Функция ПроинициализироватьКомпоненту(ПопытатьсяУстановитьКомпоненту = Истина, ИмяПараметра = Неопределено) Экспорт
	
	Если ИмяПараметра = Неопределено Тогда
		ИмяПараметра = ТелеграмАгентыКлиентСервер.ИмяПараметраКомпоненты();
	КонецЕсли;
	
	Если ПараметрыПриложения[ИмяПараметра] = Неопределено Тогда
		
		КодВозврата = ПодключитьВнешнююКомпоненту("ОбщийМакет.КомпонентаTelegram", "Telegram"); 
		Если Не КодВозврата Тогда
			
			Если Не ПопытатьсяУстановитьКомпоненту Тогда
				Возврат Ложь;
			КонецЕсли;
			
			УстановитьВнешнююКомпоненту("ОбщийМакет.КомпонентаTelegram");
			Возврат ПроинициализироватьКомпоненту(Ложь); // Рекурсивно.
			
		КонецЕсли;
		
		КомпонентаИнтеграции = Новый("AddIn.Telegram.TelegramNative");
		КомпонентаИнтеграции.УстановитьАсинхронныйРежим(Истина);

		ПараметрыПриложения.Вставить(ИмяПараметра, КомпонентаИнтеграции);
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

#КонецОбласти