
#Область ПрограммныйИнтерфейс

#Область ПолучениеДанныхВнешнихЗапросов

Функция ДанныеВнешнихЗапросов(Агент = Неопределено, ЗНАЧ ИдентификаторыЗапросов = Неопределено, ТолькоНеОбработанные = Ложь, ЗНАЧ КоличествоПервых = Неопределено, ВыполнятьДополнительнуюОбработку = Ложь, УникальныйИдентификаторФормы = Неопределено) Экспорт

	Возврат ТелеграмАгенты.ДанныеВнешнихЗапросов(Агент, ИдентификаторыЗапросов, ТолькоНеОбработанные, КоличествоПервых, ВыполнятьДополнительнуюОбработку, УникальныйИдентификаторФормы);
	
КонецФункции

#КонецОбласти

#Область ЖурналированиеВнешнихЗапросовАгентам

Процедура ОбновитьЗаписьВнешнегоЗапросаАгенту(ЗНАЧ Агент = Неопределено, ЗНАЧ ИдентификаторЗапроса, ОбновляемыеПоля) Экспорт

	ТелеграмАгенты.ОбновитьЗаписьВнешнегоЗапросаАгенту(Агент, ИдентификаторЗапроса, ОбновляемыеПоля);
	
КонецПроцедуры

#КонецОбласти

#Область ЖурналированиеЗапросовИОтветовTelegramNative

Процедура СохранитьЗапросTelegramNative(ЗНАЧ Агент = Неопределено, ЗНАЧ ИдентификаторЗапроса, ЗНАЧ СодержаниеЗапроса, ЗНАЧ ДатаОтправкиЗапроса = Неопределено) Экспорт
	
	ТелеграмАгенты.СохранитьЗапросTelegramNative(Агент, ИдентификаторЗапроса, СодержаниеЗапроса, ДатаОтправкиЗапроса);
	
КонецПроцедуры

Процедура СохранитьОтветTelegramNative(ЗНАЧ Агент = Неопределено, ЗНАЧ ИдентификаторЗапроса, ЗНАЧ СодержаниеОтвета, ЗНАЧ ДатаПолученияОтвета = Неопределено) Экспорт

	ТелеграмАгенты.СохранитьОтветTelegramNative(Агент, ИдентификаторЗапроса, СодержаниеОтвета, ДатаПолученияОтвета);
	
КонецПроцедуры

Процедура ОбновитьЗаписьЗапросаTelegramNative(ЗНАЧ Агент = Неопределено, ЗНАЧ ИдентификаторЗапроса, ОбновляемыеПоля) Экспорт

	ТелеграмАгенты.ОбновитьЗаписьЗапросаTelegramNative(Агент, ИдентификаторЗапроса, ОбновляемыеПоля);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти


