
#Область ПрограммныйИнтерфейс

Процедура ПредОбработкаОтправляемыхДанныхНаСервере(Запрос, УникальныйИдентификаторФормы) Экспорт
	
	ТелеграмАгенты.ПредОбработкаОтправляемыхДанных(Запрос, УникальныйИдентификаторФормы);
	
КонецПроцедуры

Процедура ПостОбработкаОтправляемыхДанныхНаСервере(Запрос, УникальныйИдентификаторФормы) Экспорт
	
	ТелеграмАгенты.ПостОбработкаОтправляемыхДанных(Запрос, УникальныйИдентификаторФормы);
	
КонецПроцедуры


Процедура СохранитьДанныеОтвета(Данные) Экспорт
	ТелеграмАгенты.СохранитьДанныеОтвета(Данные);
КонецПроцедуры

Процедура УстановитьПризнакОшибкиВЗапросе(ДанныеЗапроса) Экспорт
	
	ТелеграмАгенты.УстановитьПризнакОшибкиВЗапросе(ДанныеЗапроса);	
	
КонецПроцедуры

Процедура УстановитьСтатусОтправленВнешнемуЗапросу(Идентификатор) Экспорт

	ТелеграмАгенты.УстановитьСтатусОтправленВнешнемуЗапросу(Идентификатор);
	
КонецПроцедуры

#Область ЗапросыИОтветыTelegramNative

Процедура СохранитьЗапросTelegramNative(ЗНАЧ СодержаниеЗапроса, ЗНАЧ ИдентификаторЗапроса, ЗНАЧ ДатаОтправкиЗапроса, ЗНАЧ Агент = Неопределено) Экспорт
	
	ТелеграмАгенты.СохранитьЗапросTelegramNative(СодержаниеЗапроса, ИдентификаторЗапроса, ДатаОтправкиЗапроса, Агент);
	
КонецПроцедуры

Процедура СохранитьОтветTelegramNative(ЗНАЧ СодержаниеОтвета, ЗНАЧ ИдентификаторЗапроса, ЗНАЧ ДатаПолученияОтвета, ЗНАЧ Агент = Неопределено) Экспорт

	ТелеграмАгенты.СохранитьОтветTelegramNative(СодержаниеОтвета, ИдентификаторЗапроса, ДатаПолученияОтвета, Агент);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти


