
#Область ПрограммныйИнтерфейс

Функция taskPost(Запрос, ТелоЗапросаJSON = Неопределено, ТелоЗапросаСоответствие = Неопределено, Агент = Неопределено, ЗНАЧ ДатаЗапроса = Неопределено) Экспорт

	Если ДатаЗапроса = Неопределено Тогда
		ДатаЗапроса = ТекущаяДата();
	КонецЕсли;
	
	Если ТелоЗапросаJSON = Неопределено Тогда
		ТелоЗапросаJSON = Запрос.ПолучитьТелоКакСтроку();
	КонецЕсли;
	
	Если ТелоЗапросаСоответствие = Неопределено Тогда
		ТелоЗапросаСоответствие = ТелеграмАгентыКлиентСервер.ПреобразоватьВСоответствие(ТелоЗапросаJSON);			
	КонецЕсли;
	
	Если ТелоЗапросаСоответствие = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Команда = ТелоЗапросаСоответствие.Получить("@type");
	
	Если Команда = Неопределено Тогда
		Возврат Неопределено;		
	КонецЕсли;
	
	Если Агент = Неопределено Тогда
		Агент = Справочники.ТелеграмАгенты.АгентПоУмолчанию;
	КонецЕсли;
	                                      
	ИдентификаторЗапроса = ТелеграмАгенты.СохранитьВнешнийЗапросАгенту(Агент, ТелоЗапросаJSON, Команда, ДатаЗапроса);
	
	Возврат ИдентификаторЗапроса;
	
КонецФункции

#КонецОбласти