&НаКлиенте
Перем ОбработчикиОбратногоВызова;

&НаКлиенте
Перем Telegram;

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьПараметрыЗапроса(ЭтаФорма.ПараметрыЗапроса, ЭтаФорма);
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаКонсоль;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОтправитьЗапросКонсоли(Команда)

	Если Не ПроверитьПараметрыЗапроса(ЭтаФорма.ПараметрыЗапроса, ЭтаФорма) Тогда
		ТекстПредупреждения = НСтр("ru = 'Параметры запроса заполнены некорректно. Запрос не отправлен.'");
		ПоказатьПредупреждение(, ТекстПредупреждения);
		Возврат;
	КонецЕсли;
	
	ОтправитьЗапросКонсолиНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ОтправитьЗапросКонсолиНаСервере()
	
	Запрос = Новый Соответствие;
	Для Каждого Строка Из ПараметрыЗапроса Цикл
		
		Попытка
			Значение = Число(Строка.Значение);
		Исключение
			Значение = Строка.Значение;
		КонецПопытки;
			
		Запрос.Вставить(Строка.Параметр, Значение);				
	КонецЦикла;
	
	ЗапросJSON = ТелеграмАгентыКлиентСервер.ПреобразоватьВJSON(Запрос);
	
	Команда = Запрос.Получить("@type");
	
	Агент = ПредопределенноеЗначение("Справочник.ТелеграмАгенты.АгентПоУмолчанию");
	                                      
	ИдентификаторЗапроса = ТелеграмАгенты.СохранитьВнешнийЗапросАгенту(Агент, ЗапросJSON, Команда);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработкаСобытийКомпоненты


#КонецОбласти

#Область ОбработчикиОбратногоВызова

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьПараметрыЗапроса(ПараметрыЗапроса, Форма)

	ПараметрыЗапроса.Очистить();
	
	НоваяСтрока = ПараметрыЗапроса.Добавить();
	НоваяСтрока.Параметр = "@type";
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПроверитьПараметрыЗапроса(Параметры, Форма)
	
	ОбязательныеПараметры = Новый Соответствие;
	ОбязательныеПараметры.Вставить("@type", Ложь);
	
	Для Каждого Строка Из Параметры Цикл
		
		ОбязательныйПараметр = ОбязательныеПараметры.Получить(Строка.Параметр);
		
		Если ОбязательныйПараметр <> Неопределено Тогда
			ОбязательныеПараметры.Вставить(Строка.Параметр, ЗначениеЗаполнено(Строка.Значение));			
		КонецЕсли;
		
	КонецЦикла;
	
	НезаполненОбязательныйПараметр = Ложь;
	Для Каждого	ОбязательныйПараметр Из ОбязательныеПараметры Цикл
		
		Если ОбязательныйПараметр.Значение Тогда
			Продолжить;
		КонецЕсли;

		НезаполненОбязательныйПараметр = Истина;		
		ТекстСообщения = СтрШаблон(НСтр("ru = 'Не указано значение обязательного параметра ""%1"".'"), ОбязательныйПараметр.Ключ);
		Сообщить(ТекстСообщения);			

	КонецЦикла;
		
	Если НезаполненОбязательныйПараметр Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

#КонецОбласти